# Merging DataFrames

In [18]:
import pandas as pd
data_a = {'id': [1, 2, 3],
 'first': ['hima', 'yama', 'kuna'],
 'last': ['tiwa', 'shara', 'saina']}
df = pd.DataFrame(data_a,columns=['id','first','last'])
df

   id first   last
0   1  hima   tiwa
1   2  yama  shara
2   3  kuna  saina

In [21]:
data_b = {'id': [3, 4, 5],
 'intelligence': [100, 90, 20]}
df2 = pd.DataFrame(data_b,columns=['id','intelligence'])
df2

   id  intelligence
0   3           100
1   4            90
2   5            20

In [22]:
pd.merge(df,df2,on='id') # merge defaults to inner joins.

   id first   last  intelligence
0   3  kuna  saina           100

In [23]:
pd.merge(df,df2,on='id',how='outer') # outer join

   id first   last  intelligence
0   1  hima   tiwa           NaN
1   2  yama  shara           NaN
2   3  kuna  saina         100.0
3   4   NaN    NaN          90.0
4   5   NaN    NaN          20.0

In [24]:
pd.merge(df,df2,on='id',how='left') # left join

   id first   last  intelligence
0   1  hima   tiwa           NaN
1   2  yama  shara           NaN
2   3  kuna  saina         100.0

In [25]:
pd.merge(df,df2,on='id',how='right') # right join

   id first   last  intelligence
0   3  kuna  saina           100
1   4   NaN    NaN            90
2   5   NaN    NaN            20

In [27]:
#if we have different names then 

#lets say

data_c = {'id_new': [2, 3, 5],
 'intelligence': [100, 90, 20]}

df3 = pd.DataFrame(data_b,columns=['id_new','intelligence'])

In [31]:
pd.merge(df,df3,left_on='id',right_on='id_new') # not working you fix this and pull request

Empty DataFrame
Columns: [id, first, last, id_new, intelligence]
Index: []

In [32]:
pd.merge(df,df3,left_index=True,right_index=True)

   id first   last id_new  intelligence
0   1  hima   tiwa    NaN           100
1   2  yama  shara    NaN            90
2   3  kuna  saina    NaN            20